#Дано список(А) із К елементів (К- парне число). Утворити 2 списки(В і С), 
# переписуючи у списку В першу половину масиву А, 
# у список С – другу половину масиву А
a = int(input("Введіть початок інтервалу: "))
b = int(input("Введіть кінець інтервалу: "))
spisok = [1,2,3,4,5,6,7,8,9,10,22,33,44,55,11,34]
interval = range(a, b + 1)
ps1 = []
ps2 = []
for x in spisok:
    if x in interval:
        ps1.append(x)
    else:
        ps2.append(x)
print("Список : ", spisok)        
print("Список B(part1) --> ", ps1)
print("Список C(part2) --> ",ps2)
