 
#Дано список. Поміняти місцями перший елемент з другим, третій з четвертим, 
# і т.д. Вивести змінений масив на екран
arr = list(map(int,input('Введіть деяку кількість чисел через пробіл: ').split()))
print(arr)
k = 1
for i in range(len(arr)//1):
    print("\nБуло - ", i, arr)
    arr[k], arr[i] = arr[i], arr[k]
    print("стало - ", arr)
    k = -1